tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "automake"
brew "bash"
brew "cloc"
brew "composer"
brew "coreutils"
brew "deno"
brew "dnsmasq", restart_service: true
brew "exiftool"
brew "ffmpeg"
brew "findutils"
brew "git", link: false
brew "gnu-sed"
brew "libusb"
brew "gnupg", link: false
brew "grep"
brew "htop"
brew "mysql", restart_service: true
brew "neofetch"
brew "nginx", restart_service: true
brew "nmap"
brew "nvm"
brew "php"
brew "postgresql", restart_service: true
brew "python@3.8"
brew "rsync"
brew "rustup-init"
brew "shellcheck"
brew "starship"
brew "stow"
brew "tectonic"
brew "telnet"
brew "tree"
brew "unzip"
brew "vim"
brew "watchman"
brew "wget"
brew "zip"
brew "zsh"
cask "alfred"
cask "arduino"
cask "balenaetcher"
cask "bitwarden"
cask "cleanmymac"
cask "discord"
cask "docker"
cask "firefox"
cask "forticlient"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "jetbrains-toolbox"
cask "microsoft-office"
cask "microsoft-teams"
cask "sequel-ace"
cask "spectacle"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wireshark"
