tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "automake"
brew "bash"
brew "bat"
brew "python@3.9"
brew "borgbackup"
brew "glib"
brew "pkg-config"
brew "composer"
brew "coreutils"
brew "dnsmasq", restart_service: true
brew "dos2unix"
brew "exiftool"
brew "findutils"
brew "folly"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "grep"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "libusb"
brew "mailhog", restart_service: true
brew "mas"
brew "mysql", restart_service: true
brew "neofetch"
brew "nginx", restart_service: true
brew "nmap"
brew "nvm"
brew "php", restart_service: true
brew "platformio"
brew "postgresql", restart_service: true
brew "ripgrep"
brew "rsync"
brew "rustup-init"
brew "shellcheck"
brew "starship"
brew "tectonic"
brew "unzip"
brew "vim"
brew "watchman"
brew "wget"
brew "zip"
brew "zsh"
cask "1password-beta"
cask "alfred"
cask "balenaetcher"
cask "bitwarden"
cask "cleanmymac"
cask "discord"
cask "docker"
cask "firefox"
cask "forticlient-vpn"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "jetbrains-toolbox"
cask "microsoft-office"
cask "microsoft-teams"
cask "minecraft"
cask "openscad"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "vorta"
cask "whatsapp"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
